/*Начальный вклад в банке равен 1000 руб. Через каждый месяц раз-
мер вклада увеличивается на P процентов от имеющейся суммы (P—
вещественное число, 0 < P < 25). По данному P определить, через сколько месяцев размер вклада превысит 1100 руб., и вывести найденное количество месяцев K (целое число) и итоговый размер вклада S (вещественное)*/
#include <stdio.h>
int main() {
    float first_vklad = 1000.0;
    float summa = 1000.0;
    float p;
    scanf("%f", &p);
    int mounth = 0;
    while (summa <= 1100.0) {
        summa = summa * (1.0 + p / 100.0);
        mounth++;}
        printf("%d\n%f\n", mounth,  summa);
    return 0;
}
    
        
