//Даны два числа. Вывести вначале большее, а затем меньшее из них Формат ввода данных: На одной строке через пробел написаны два целых числа. Формат вывода данных: Программа должна вывести два целых числа каждое на отдельной строке: В первом строке - больше из двух данных чисел. Во втором строке - меньше из них.
#include <stdio.h>
int main() {
int x, a;
    scanf("%d%d", &x, &a);
    if ( a > x){
    printf("%d\n", a);
        printf("%d\n", x);
     }
    else {
    printf("%d\n", x);
        printf("%d\n", a);
      return 0;}
}