from stat import filemode

print('======привет, это онлайн анкета======')
print('как тебя зовут?')
name = input('Введите ваше имя: ')
print('привет', name, 'сколько тебе лет?')
age = int(input('Введите ваш возраст (цифрами): '))
if age > 18:
    print('хочешь порекомендую фильм?')
    print('выбери любимый жанр: 1. триггеры 2. романтика 3.драма')
    a = int(input('Введите цифру жанра: '))
    if a == 1:
        print('ты можешь посмотреть\n 1.пила\n 2.ужасающий')
        print('давай расскажу подробнее про фильм который понравился, да/нет')
        answer = input('Ваш ответ: ')
        if answer == 'да':
            print('супер, напиши цифру понравившегося фильма')
            ans2 = int(input('Введите цифру фильма: '))
            if ans2 == 1:
                print('«Пила» — это психологический триллер о двух незнакомцах,\n запертых в подвале жестоким маньяком по прозвищу «Конструктор».\n Чтобы выжить, им нужно пройти кровавые испытания\n и пожертвовать частью себя. Главный сюжетный\n поворот ждёт зрителя в самом финале фильма.')
            else:
                print('«Ужасающий» (Terrifier) — это экстремальный слэшер о \n немом маньяке в костюме клоуна по имени Арт, который \n жестоко и хладнокровно преследует своих жертв \n в ночь на Хэллоуин')
    elif a == 2:
        print('ты можешь посмотреть \n1.дневник памяти\n 2. в поисках любви')
        print('давай расскажу подробнее про фильм который понравился, да/нет')
        answer = input('Ваш ответ: ')
        if answer == 'да':
            print('супер, напиши цифру понравившегося фильма')
            ans2 = int(input('Введите цифру фильма: '))
            if ans2 == 1:
                print('«Дневник памяти» — это трогательная мелодрама о глубокой \n любви парня из бедной семьи и девушки из высшего общества, \nкоторых разлучают родители, а затем война. Спустя годы \n они встречаются вновь и понимают, что их чувства не угасли,\n несмотря на помолвку героини с другим.')
            else:
                print('«В поисках любви» (или «Погоня за любовью», 2021) — это яркий\n  британский мини-сериал о двух кузинах-аристократках,\n которые взрослеют в Европе между двумя мировыми войнами и \n отчаянно ищут своё личное счастье')
    else:
        print('ты можешь посмотреть\n 1.титаник\n 2.вот это драмма!')
        print('давай расскажу подробнее про фильм который понравился, да/нет')
        answer = input('Ваш ответ: ')
        if answer == 'да':
            print('супер, напиши цифру понравившегося фильма')
            ans2 = int(input('Введите цифру фильма: '))
            if ans2 == 1:
                print('«Титаник» — это культовая масштабная драма о запретной любви\n бедного художника и богатой аристократки на борту роскошного\n и «непотопляемого» лайнера. Их стремительный роман обрывается\n страшной катастрофой из-за столкновения корабля с айсбергом\n в Атлантическом океане. В финале герои борются за выживание в\n ледяной воде, где ради спасения любимой парень жертвует\n собственной жизнью.')
            else:
                print('«Вот это драма!» (2026) — это остроумный антиромком от студии A24\n с Зендеей и Робертом Паттинсоном, чьи герои готовятся к свадьбе. За неделю\n до торжества на дружеском ужине пара решает сыграть в откровенную игру и поделиться своими худшими поступками.\n Невинное признание невесты вскрывает шокирующий секрет из её прошлого, который\n ставит под удар их идеальный брак.')
    print('на этом все, пока',name)



else:
    print(' для тебя у меня есть отличные семейные и подростковые рекомендации!')
    print('Выбери, что тебе ближе:\n1. Анимация и мультфильмы\n2. Приключения и фантастика')
    a = int(input('Введи цифру жанра: '))
    if a == 1:
        print('ты можешь посмотреть:\n1. Тайна Коко\n2. Головоломка 2')
        answer = input('давай расскажу подробнее про фильм который понравился? (да/нет): ')
        if answer == 'да':
            ans2 = input('супер, напиши цифру понравившегося фильма: ')
            if ans2 == '1':
                print('«Тайна Коко» — невероятно красивый и трогательный мультфильм о 12-летнем Мигеле,\n который мечтает стать музыкантом и случайно попадает в красочную Страну Мертвых,\n где ему предстоит разгадать тайну своей семьи.')
            else:
                print(
                    '«Головоломка 2» — продолжение истории о девочке Райли. В её голове к знакомым\n Радости, Печали и Страху добавляются новые подростковые эмоции, главная\n из которых — Тревожность. Очень жизненный и веселый мультфильм.')
    else:
        print('ты можешь посмотреть:\n1. Гарри Поттер и философский камень\n2. Первому игроку приготовиться')
        answer = input('давай расскажу подробнее про фильм который понравился? (да/нет): ')
        if answer == 'да':
            ans2 = input('супер, напиши цифру понравившегося фильма: ')
            if ans2 == '1':
                print(
                    '«Гарри Поттер и философский камень» — культовое начало истории о мальчике-сироте,\n который узнает, что он волшебник, и отправляется учиться в школу магии Хогвартс,\n где находит верных друзей и сталкивается с первыми опасностями.')
            else:
                print(
                    '«Первому игроку приготовиться» — захватывающий фантастический фильм\n Стивена Спилберга о недалеком будущем, где люди проводят всё время в виртуальной\n игре OASIS. Главный герой пытается отыскать в игре главный секрет-пасхалку, \n оставленный её создателем.')

    print('на этом все, пока,', name)
